; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v7 - type_1 ?v1 - type_2)
 	      (pred_4 ?v6 - object ?v1 - type_2)
	      (pred_3 ?v7 - type_1 ?v8 - type_3)
	      (pred_1 ?v7 - type_1 ?v6 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v7 - type_1 ?v2 ?v5 - type_2)
       :precondition (and  (pred_2 ?v7 ?v2))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v2))))

   (:action op_2
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v4 ?v3) (pred_2 ?v7 ?v3) (pred_3 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v4 ?v8)
		    (not (pred_4 ?v4 ?v3)) 
		    (not (pred_3 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v4 ?v8) (pred_2 ?v7 ?v3))
       :effect (and (pred_4 ?v4 ?v3)
		    (pred_3 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v4 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_07 obj_08 - type_3
obj_04 obj_06 obj_09 obj_05 - type_2
obj_10 obj_01 obj_03 - object)
(:init
(pred_2 obj_02 obj_06)
(pred_3 obj_02 obj_07)
(pred_3 obj_02 obj_08)
(pred_4 obj_10 obj_05)
(pred_4 obj_01 obj_09)
(pred_4 obj_03 obj_04)
)
(:goal
(and
(pred_4 obj_10 obj_09)
(pred_4 obj_01 obj_06)
(pred_4 obj_03 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_02 ?b obj_08))))
)
)

; plan
1. (op_3 obj_02 obj_06 obj_04)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_04)
   goals met: 0 of 3
2. (op_2 obj_02 obj_03 obj_04 obj_07)
   deleted: (pred_4 obj_03 obj_04) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_03 obj_07)
   goals met: 0 of 3
3. (op_3 obj_02 obj_04 obj_06)
   deleted: (pred_2 obj_02 obj_04)
   added: (pred_2 obj_02 obj_06)
   goals met: 0 of 3
4. (op_1 obj_02 obj_03 obj_06 obj_07)
   deleted: (pred_1 obj_02 obj_03 obj_07)
   added: (pred_4 obj_03 obj_06) (pred_3 obj_02 obj_07)
   goals met: 1 of 3
5. (op_3 obj_02 obj_06 obj_05)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_05)
   goals met: 1 of 3
6. (op_2 obj_02 obj_10 obj_05 obj_07)
   deleted: (pred_4 obj_10 obj_05) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_10 obj_07)
   goals met: 1 of 3
7. (op_3 obj_02 obj_05 obj_09)
   deleted: (pred_2 obj_02 obj_05)
   added: (pred_2 obj_02 obj_09)
   goals met: 1 of 3
8. (op_1 obj_02 obj_10 obj_09 obj_07)
   deleted: (pred_1 obj_02 obj_10 obj_07)
   added: (pred_4 obj_10 obj_09) (pred_3 obj_02 obj_07)
   goals met: 2 of 3
9. (op_2 obj_02 obj_01 obj_09 obj_07)
   deleted: (pred_4 obj_01 obj_09) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_01 obj_07)
   goals met: 2 of 3
10. (op_3 obj_02 obj_09 obj_06)
   deleted: (pred_2 obj_02 obj_09)
   added: (pred_2 obj_02 obj_06)
   goals met: 2 of 3
11. (op_1 obj_02 obj_01 obj_06 obj_07)
   deleted: (pred_1 obj_02 obj_01 obj_07)
   added: (pred_4 obj_01 obj_06) (pred_3 obj_02 obj_07)
   goals met: 3 of 3
